#define _CRT_SECURE_NO_WARNINGS


#include <stdio.h>

//int main()
//{
//	int i = 0;
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	printf("%p\n", arr);
//	printf("%p\n", &i);
//
//	//for (i = 0; i <= 12; i++)
//	//{
//	//	arr[i] = 0;
//	//	printf("hehe\n");
//	//}
//
//	return 0;
//}


//数值有不同表示形式
//2进制        0b10101   0b是二进制
//8进制        025       0是8进制
//10进制       21
//16进制       0x15      0x是16进制
//
//
//
//
//
//
//整数的2进制表示也有三种表示形式:
// 1.正的整数，原码、反码、补码相同
// 2.负的整数，原码、反码、补码是需要计算的
//原码:直接通过正负的形式写出的二进制序列就是原码
//反码:原码的符号位不变，其他位按位取法得到的就是反码
//补码:反码+1就是补码
//整数内存中存放是补码的二进制序列


//int main()
//{
//	int a = 20;
//	//20
//    //00000000000000000000000000010100
//	//0x00 00 00 14                      为了方便表示，我们把每4个2进制位写成一个16进制位
//    //00000000000000000000000000010100
//    //00000000000000000000000000010100
//
//	int b = -10;
//	//10000000000000000000000000001010 -原
//	//0x80 00 00 0a
//	//11111111111111111111111111110101 -反
//	//0xff ff ff f5
//	//11111111111111111111111111110110 -补
//	//0xff ff ff f6
//	//
//
//
//	return 0;
//}


int main()
{
	int a = 1;
	if (*(char*)&a == 1)
	{
		printf("本机器是小端存储");
	}
	else
	{
		printf("本机器是大端存储");
	}


	return 0;
}




